dependencies/OpenFOAM/modules/OpenQBMM/tutorials/denseAGFoam/verticalChannel-a01-p4/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceFormat vtk;


interpolationScheme cellPointFace;

fields
(
    alpha.particles
	U.particles
	U.air
	Theta.particles
);


surfaces
(

            VSlice
            {
                type            plane;    
                basePoint       (0.0 0.0 0.03);
                normalVector    (0 0 1);
            }
            HSlice
            {
                type            plane;   
                basePoint       (0.0 0.15 0.0);
                normalVector    (0 1 0);
            }

);


// *********************************************************************** //
